#### 🖌 Terraform Format and Style: `success`
#### ⚙️ Terraform Initialization: `success`
#### 🤖 Terraform Validation: `success`
  <details><summary>Validation Output</summary>

  ```

  Success! The configuration is valid.


  ```

  </details>

#### 📖 Terraform Plan: `success`

  <details><summary>Plan Details</summary>

  ```

  terraform
module.project_services.google_project_service.project_services["compute.googleapis.com"]: Refreshing state... [id=m2vn-sandbox/compute.googleapis.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.app_image will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "app_image" {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "./scripts/get_artifacts_docker_image.sh",
        ]
      + query   = {
          + "image_name"    = "dev-hieu-image"
          + "project_id"    = "m2vn-sandbox"
          + "region"        = "us-central1"
          + "repo_id"       = "dev-hieu-repo"
          + "repo_location" = "us-central1"
        }
      + result  = (known after apply)
    }

  # data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + tags                = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # time_sleep.wait_apis_enabled will be created
  + resource "time_sleep" "wait_apis_enabled" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # module.artifact_registry.google_artifact_registry_repository.default will be created
  + resource "google_artifact_registry_repository" "default" {
      + create_time      = (known after apply)
      + effective_labels = {
          + "app"                        = "hieu"
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + labels           = {
          + "app" = "hieu"
          + "env" = "dev"
        }
      + location         = "us-central1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "m2vn-sandbox"
      + repository_id    = "dev-hieu-repo"
      + terraform_labels = {
          + "app"                        = "hieu"
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
    }

  # module.cloud_run.google_cloud_run_service_iam_member.public-access will be created
  + resource "google_cloud_run_service_iam_member" "public-access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = "m2vn-sandbox"
      + role     = "roles/run.invoker"
      + service  = "dev-hieu-service"
    }

  # module.cloud_run.google_cloud_run_v2_service.default will be created
  + resource "google_cloud_run_v2_service" "default" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "app"                        = "hieu"
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + labels                  = {
          + "app" = "hieu"
          + "env" = "dev"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "dev-hieu-service"
      + observed_generation     = (known after apply)
      + project                 = "m2vn-sandbox"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "app"                        = "hieu"
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = (known after apply)

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

  # module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "m2vn-sandbox"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project_services.google_project_service.project_services["compute.googleapis.com"] will be updated in-place
  ~ resource "google_project_service" "project_services" {
      ~ disable_on_destroy         = true -> false
        id                         = "m2vn-sandbox/compute.googleapis.com"
        # (3 unchanged attributes hidden)
    }

  # module.project_services.google_project_service.project_services["run.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "m2vn-sandbox"
      + service                    = "run.googleapis.com"
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + app_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>

*Pusher: @hieutranm2, Action: `pull_request`, Workflow: `ci-terraform`, Time: `12/23/2024, 10:46:46 AM`*